[
   {
      "id": "6006e957ba3446a48dd25fd4",
      "title": "Laputa: Castle in the sky",
      "trailer": "https://www.youtube.com/watch?v=8ykEy-yPBFc",
      "rating": "8.0",
      "directors": "Hayao Miyazaki",
      "description": "Pazu, an engineer's apprentice finds a young girl, Sheeta floating down from the sky wearing a glowing pendant. Together they discover both are searching for the legendary floating castle Laputa and vow to unravel the mystery of the luminous crystal around her neck. Their quest won't be easy however. There are air pirates, secret agents and astounding obstacles to keep them from the truth - and from each other.",
      "releasedDate": "August 2, 1986",
      "runtime": "124 minutes",
      "review": "[]",
      "imageCover": "Laputa-1-cover.jpg",
      "images": [
         "Laputa-1-1.jpg",
         "Laputa-1-2.jpg",
         "Laputa-1-3.jpg"
      ]
   },
   {
      "id": "60082383ba3446a48dd25fd5",
      "title": "Grave of the Fireflies",
      "trailer": "https://www.youtube.com/watch?v=4vPeTSRd580",
      "rating": "8.5",
      "directors": "Isao Takahata",
      "description": "In the aftermath of a World War II bombing, two orphaned children struggle to survive in the Japanese countryside. To Seita and his four-year-old sister, the helplessness and indifference of their countrymen is even more painful than the enemy raids. Through desperation, hunger and grief, these children's lives are as heartbreakingly fragile as their spirit and love is inspiring.",
      "releasedDate": "16 April, 1988",
      "runtime": "89 minutes",
      "review": "[]",
      "imageCover": "Grave_of_the_Fireflies-1-cover.jpg",
      "images": [
         "Grave_of_the_Fireflies-1-1.jpg",
         "Grave_of_the_Fireflies-1-2.jpg",
         "Grave_of_the_Fireflies-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "My Neighbor Totoro",
      "trailer": "https://www.youtube.com/watch?v=WJC1qciW_3k",
      "rating": "8.2",
      "directors": "Hayao Miyazaki",
      "description": "Two young girls, Satsuki and Mei, have moved with their father into a new home in the country, while their mother recovers from illness in a nearby hospital. To their surprise, they soon discover that they share this home with some rather unusual creatures and even stranger neighbours - forest guardians that the girls dub Totoro. When trouble occurs, their new friends will help them rediscover hope.",
      "releasedDate": "April 16, 1988",
      "runtime": "86 minutes",
      "review": "[]",
      "imageCover": "My_Neighbor_Totoro-1-cover.jpg",
      "images": [
         "My_Neighbor_Totoro-1-1.jpg",
         "My_Neighbor_Totoro-1-2.jpg",
         "My_Neighbor_Totoro-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Kiki's Delivery Service",
      "trailer": "https://www.youtube.com/watch?v=4bG17OYs-GA",
      "rating": "7.8",
      "directors": "Hayao Miyazaki",
      "description": "It is tradition for all young witches to leave their families on the night of a full moon to learn their craft. That night comes for Kiki, who follows her dream and embarks on the experience of a lifetime. With her chatty black cat, Jiji, she flies off to find the perfect spot in a faraway city. There, a bakery owner befriends Kiki and helps her start her own business: A high-flying delivery service.",
      "releasedDate": "July 29, 1989",
      "runtime": "103 minutes",
      "review": "[]",
      "imageCover": "Kiki's_Delivery_Service-1-cover.jpg",
      "images": [
         "Kiki's_Delivery_Service-1-1.jpg",
         "Kiki's_Delivery_Service-1-2.jpg",
         "Kiki's_Delivery_Service-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Only Yesterday",
      "trailer": "https://www.youtube.com/watch?v=OfkQlZArxw0",
      "rating": "7.6",
      "directors": "Isao Takahata",
      "description": "Taeko, a single woman working a desk job in Tokyo, has reached a point in her life where she needs to get away from her job, her family and most of all, big city life. A much needed vacation to the countryside stirs childhood memories, recalling her time as a schoolgirl in 1966. Amidst beautiful country scenery, Taeko reflects on her life and forming new friendships, begins to make some tough decisions about her future.",
      "releasedDate": "July 20, 1991",
      "runtime": "118 minutes",
      "review": "[]",
      "imageCover": "Only_Yesterday-1-cover.jpg",
      "images": [
         "Only_Yesterday-1-1.jpg",
         "Only_Yesterday-1-2.jpg",
         "Only_Yesterday-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Porco Rosso",
      "trailer": "https://www.youtube.com/watch?v=awEC-aLDzjs",
      "rating": "7.7",
      "directors": "Hayao Miyazaki",
      "description": "When 'Porco' - whose face has been transformed into that of a pig by a mysterious spell - infuriates a band of sky pirates with his aerial heroics, the pirates hire Curtis, a comical rival pilot, to 'get rid' of him. On the ground, the two pilots compete over the affections of Gina, a beautiful cabaret singer. But it is in the air, with Fio, a young and talented airplane engineer/designer, where Porco's true battles are waged. From its Mediterranean Sea settings to its dazzling aerial dogfights of amazing sweep and grace, PORCO ROSSO is an exhilarating ride you'll never forget.",
      "releasedDate": "July 18, 1992",
      "runtime": "94 minutes",
      "review": "[]",
      "imageCover": "Porco_Rosso-1-cover.jpg",
      "images": [
         "Porco_Rosso-1-1.jpg",
         "Porco_Rosso-1-2.jpg",
         "Porco_Rosso-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Pom Poko",
      "trailer": "https://www.youtube.com/watch?v=_7cowIHjCD4",
      "rating": "8.0",
      "directors": "Isao Takahata",
      "description": "POM POKO is a tale of the clash between modern civilization and the natural world. The Raccoons of the Tama Hills are being forced from their homes by rapid urbanisation. As it becomes harder to find food and shelter, they decide to band together and fight back. Once they perfect the ancient art of transformation, they use their power, often in hilarious ways, to try to scare off the advancement of civilization. Will it be enough?",
      "releasedDate": "July 16, 1994",
      "runtime": "119 minutes",
      "review": "[]",
      "imageCover": "Pom_Poko-1-cover.jpg",
      "images": [
         "Pom_Poko-1-1.jpg",
         "Pom_Poko-1-2.jpg",
         "Pom_Poko-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Whisper of the Heart",
      "trailer": "https://www.youtube.com/watch?v=0pVkiod6V0U",
      "rating": "7.9",
      "directors": "Yoshifumi Kondō",
      "description": "Shizuku Tsukishima is a bit of a book-worm, spending her last summer vacation in junior high school reading and translating popular foreign music into Japanese. With aspirations to one day become a writer, Shizuku can't help but notice that the name Seiji Amasawa appears on every one of the books she borrows from the library. Through a series of curious and magical incidents, she comes to meet Seiji and discovers he has dreams of becoming a famous violin maker in Italy. While their life-long goals pull them in two different directions, Shizuku and Seiji are determined to remain true to their strong feelings for one another.",
      "releasedDate": "July 15, 1995",
      "runtime": "111 minutes",
      "review": "[]",
      "imageCover": "Whisper_of_the_Heart-1-cover.jpg",
      "images": [
         "Whisper_of_the_Heart-1-1.jpg",
         "Whisper_of_the_Heart-1-2.jpg",
         "Whisper_of_the_Heart-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Princess Mononoke",
      "trailer": "https://www.youtube.com/watch?v=4OiMOHRDs14",
      "rating": "8.4",
      "directors": "Hayao Miyazaki",
      "description": "While protecting his village from a rampaging boar-god, the young warrior Ashitaka becomes afflicted with a deadly curse. To find the cure that will save his life, he journeys deep into sacred depths of the Great Forest Spirit's realm where he meets San (Princess Mononoke), a girl raised by wolves. It's not long before Ashitaka is caught in the middle of a battle between iron-ore prospecting humans and the forest dwellers. He must summon the spirit-powers and all his courage to stop man and nature from destroying each other.",
      "releasedDate": "July 12, 1997",
      "runtime": "133 minutes",
      "review": "[]",
      "imageCover": "Princess_Mononoke-1-cover.jpg",
      "images": [
         "Princess_Mononoke-1-1.jpg",
         "Princess_Mononoke-1-2.jpg",
         "Princess_Mononoke-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "My Neighbors the Yamadas",
      "trailer": "https://www.youtube.com/watch?v=1C9ujuCPlnY",
      "rating": "7.2",
      "directors": "Isao Takahata",
      "description": "Join in the adventures of the quirky Yamada family - from the hilarious to the touching - brilliantly presented in a unique, visually striking comic strip style. Takashi Yamada and his wacky wife Matsuko, who has no talent for housework, navigate their way through the ups and downs of work, marriage, and family life with a sharp-tongued grandmother who lives with them, a teenage son who wishes he had cooler parents, and a pesty daughter whose loud voice is unusual for someone so small. Even the family dog has issues! Experience the little victories in life with MY NEIGHBORS THE YAMADAS - featuring the voice talents of comedic stars Jim Belushi and Molly Shannon.",
      "releasedDate": "17 July 1999",
      "runtime": "104 minutes",
      "review": "[]",
      "imageCover": "My_Neighbors_the_Yamadas-1-cover.jpg",
      "images": [
         "My_Neighbors_the_Yamadas-1-1.jpg",
         "My_Neighbors_the_Yamadas-1-2.jpg",
         "My_Neighbors_the_Yamadas-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Spirited Away",
      "trailer": "https://www.youtube.com/watch?v=ByXuk9QqQkk",
      "rating": "8.6",
      "directors": "Hayao Miyazaki",
      "description": "Spirited Away is a wondrous fantasy about a young girl named Chihiro who discovers a secret world of strange spirits, creatures and sorcery. When her parents are mysteriously transformed, she must call upon the courage she never knew she had to free herself and return her family to the outside world.",
      "releasedDate": "July 20, 2001",
      "runtime": "125 minutes",
      "review": "[]",
      "imageCover": "Spirited_Away-1-cover.jpg",
      "images": [
         "Spirited_Away-1-1.jpg",
         "Spirited_Away-1-2.jpg",
         "Spirited_Away-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "The Cat Returns",
      "trailer": "https://www.youtube.com/watch?v=Gp-H_YOcYTM",
      "rating": "7.2",
      "directors": "Hiroyuki Morita",
      "description": "Haru, a schoolgirl bored by her ordinary routine, saves the life of an unusual cat, and suddenly her world is transformed beyond anything she's ever imagined. Her good deed is rewarded with a flurry of presents, including gift-wrapped mice, and one very shocking proposal of marriage - to the Cat's King's son! Haru embarks on an unexpected journey to the Kingdom of Cats where her eyes are opened to a whole other world and her destiny is uncertain. To change her fate she'll need to learn to believe in herself, and in the process she will learn to appreciate her everyday life. THE CAT RETURNS is a magical animated adventure that will delight and inspire everyone.",
      "releasedDate": "July 20, 2002",
      "runtime": "75 minutes",
      "review": "[]",
      "imageCover": "The_Cat_Returns-1-cover.jpg",
      "images": [
         "The_Cat_Returns-1-1.jpg",
         "The_Cat_Returns-1-2.jpg",
         "The_Cat_Returns-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Howl's Moving Castle",
      "trailer": "https://www.youtube.com/watch?v=iwROgK94zcM",
      "rating": "8.2",
      "directors": "Hayao Miyazaki",
      "description": "Sophie, an average teenage girl working in a hat shop, finds her life thrown into turmoil when she is literally swept off her feet by a handsome but mysterious wizard named Howl. After this chance meeting she is turned into a 90-year old woman by the vain and conniving Witch of the Waste. Embarking on an incredible adventure to lift the curse, she finds refuge in Howl's magical moving castle where she becomes acquainted with Markl, Howl's apprentice, and a hot-headed fire demon named Calcifer. As the true power of Howl's wizardry is revealed, and his relationship with Sophie deepens, our young grey heroine finds herself fighting to protect them both from a dangerous war of sorcery that threatens their world.",
      "releasedDate": "5 September 2004",
      "runtime": "119 minutes",
      "review": "[]",
      "imageCover": "Howl's_Moving_Castle-1-cover.jpg",
      "images": [
         "Howl's_Moving_Castle-1-1.jpg",
         "Howl's_Moving_Castle-1-2.jpg",
         "Howl's_Moving_Castle-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Tales from Earthsea",
      "trailer": "https://www.youtube.com/watch?v=8hxYx3Jq3kI",
      "rating": "6.4",
      "directors": "Gorō Miyazaki",
      "description": "In the land of Earthsea, crops are failing and livestock dying. Two dragons appear from the storm clouds and devour each other - an omen of impending disaster. The balance of the world is in peril of tearing apart. In his search for the cause of this encroaching catastrophe, the Archmage Ged, the greatest of wizards, meets Arren, exiled Prince of Enlad, in flight from a nameless Shadow. They journey through ruined landscapes to Hort Town - a city where blank citizens deal only in fake goods, slaves are traded and addicts wander the dangerous streets - and cross paths with Therru, an orphan girl with a fire-scarred face. Ged learns that the wizard Cob, in his search for eternal life, is preparing to open the door between the realms of the living and the dead. An old and defeated adversary, Cob has sworn to take terrible revenge on Ged.",
      "releasedDate": "July 29, 2006",
      "runtime": "115 minutes",
      "review": "[]",
      "imageCover": "Tales_from_Earthsea-1-cover.jpg",
      "images": [
         "Tales_from_Earthsea-1-1.jpg",
         "Tales_from_Earthsea-1-2.jpg",
         "Tales_from_Earthsea-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Ponyo",
      "trailer": "https://www.youtube.com/watch?v=CsR3KVgBzSM",
      "rating": "7.7",
      "directors": "Hayao Miyazaki",
      "description": "In a small town by the sea lives five year old Sosuke, high on a cliff overlooking the Inland Sea. One morning while playing on the rocky beach below his house, he discovers a goldfish he names Ponyo, her head stuck in a jam jar. Sosuke rescues Ponyo and keeps her in a green plastic bucket. Both Ponyo and Sosuke are fascinated by each other and promise to stay firm friends until Ponyo's father, a sorcerer who lives deep under the sea, forces her to return with him to the ocean depths. What follows is an amazing underwater adventure for all ages...",
      "releasedDate": "July 19, 2008",
      "runtime": "101 minutes",
      "review": "[]",
      "imageCover": "Ponyo-1-cover.jpg",
      "images": [
         "Ponyo-1-1.jpg",
         "Ponyo-1-2.jpg",
         "Ponyo-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "Arrietty",
      "trailer": "https://www.youtube.com/watch?v=9CtIXPhPo0g",
      "rating": "7.6",
      "directors": "Hayao Miyazaki",
      "description": "This is a story of a family of 'little' people. In this whimsical adventure, tiny 14-year-old Arrietty lives under the floorboards of a sprawling mansion set in a magical, overgrown garden with her father and mother. Arrietty and her family live by borrowing. Everything they have, they borrow or make from the things they have borrowed from the old lady who lives in the mansion. Their peaceful life is dramatically changed when the ever-curious Arrietty accidentally allows herself to be seen by Sho, a lonely 12-year-old human boy. The two begin to confide in each other and, before long, a friendship begins to blossom...",
      "releasedDate": "17 July 2010",
      "runtime": "95 minutes",
      "review": "[]",
      "imageCover": "Arrietty-1-cover.jpg",
      "images": [
         "Arrietty-1-1.jpg",
         "Arrietty-1-2.jpg",
         "Arrietty-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "From Up on Poppy Hill",
      "trailer": "https://www.youtube.com/watch?v=9nzpk_Br6yo",
      "rating": "7.4",
      "directors": "Gorō Miyazaki",
      "description": "Umi is a high school girl, living with her family in the beautiful seaside town of Yokahama Bay. Each day she raises a pair of flags in anticipation of the return of her sailor father, who went missing some years previously. One day Umi meets Shun, a member of the school's literature club, and the two students decide to restore the school's rundown clubhouse to its former glory. However, a local businessman plans to demolish the clubhouse for redevelopment, so Umi and Shun band together with their schoolmates in order to stop their beloved clubhouse from destruction. In the process Uma begins to falls in love with Shun, but there's a secret she will uncover that threatens their future happiness together...",
      "releasedDate": "July 16, 2011",
      "runtime": "92 minutes",
      "review": "[]",
      "imageCover": "From_Up_on_Poppy_Hill-1-cover.jpg",
      "images": [
         "From_Up_on_Poppy_Hill-1-1.jpg",
         "From_Up_on_Poppy_Hill-1-2.jpg",
         "From_Up_on_Poppy_Hill-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "The Wind Rises",
      "trailer": "https://www.youtube.com/watch?v=6zhLBe319KE",
      "rating": "7.8",
      "directors": "Hayao Miyazaki",
      "description": "A thousand years after a great war, a seaside kingdom known as the Valley of the Wind is one of the only areas that remains populated. Led by the courageous Princess Nausicaä, the people of the Valley are engaged in a constant struggle with powerful insects called ohmu, who guard a poisonous jungle that is spreading across the Earth. Nausicaä and her brave companions, together with the people of the Valley, strive to restore the bond between humanity and the earth.",
      "releasedDate": "20 July 2013",
      "runtime": "126 minutes",
      "review": "[]",
      "imageCover": "The_Wind_Rises-1-cover.jpg",
      "images": [
         "The_Wind_Rises-1-1.jpg",
         "The_Wind_Rises-1-2.jpg",
         "The_Wind_Rises-1-3.jpg"
      ]
   },
   {
      "id": "5c88fa8cf4afda39709c2955",
      "title": "The Tale of the Princess Kaguya",
      "trailer": "https://www.youtube.com/watch?v=W71mtorCZDw",
      "rating": "8.0",
      "directors": "Isao Takahata",
      "description": "Found inside a shining stalk of bamboo, a tiny girl grows into an exquisite young lady, raised by an old bamboo cutter and his wife. From the countryside to the grand capital city, even unseen she enthralls all who encounter her, including five noble suitors. Ultimately she must face her fate, punishment for her crime. Based on the classic Japanese folktale, 'The Tale of the Bamboo Cutter', 'The Tale of The Princess Kayuga' is the strikingly beautiful culmination of decades of contemplation by director and Studio Ghibli co-founder Isao Takahata.",
      "releasedDate": "23 November 2013",
      "runtime": "137 minutes",
      "review": "[]",
      "imageCover": "The_Tale_of_the_Princess_Kaguya-1-cover.jpg",
      "images": [
         "The_Tale_of_the_Princess_Kaguya-1-1.jpg",
         "The_Tale_of_the_Princess_Kaguya-1-2.jpg",
         "The_Tale_of_the_Princess_Kaguya-1-3.jpg"
      ]
   }
]